import React from 'react';
import {View, StyleSheet} from 'react-native';
import {withRouter, useParams} from 'react-router-native';

import trichomeal from '../Images/trichomeal.png';

import Header from '../Components/Header/ProductDetailsPage/index';
import {Data, BuyButton} from '../Components/ProductDetails/index';

const ProductDetailsPage = ({history}) => {
  let {pid} = useParams();
  return (
    <View style={styles.container}>
      <Header image={trichomeal} productName="ટ્રાઈકોમીલ" history={history} />
      <Data
        data="જેઓ ¢વ¢થતાǑૂવક પડો, જેથી તેઓ આનંદ મેળવવા માટે કામ કરʂ શકે અને દ: ખ, કેટલાક મહાન. ુ
કારણ કે, જેમ આપણે સૌથી નાના વ¢Ǎુઓ સાથે આવે છે, જે અમે કેટલાક લાભ મેળવવા ɫસવાય, તે
હʘમેશા દઃખદાયક શારʂɨરક ÜǘૃɫŰ લે છે આમાંથી; પરʘǍુ કોઈ Ǔૂલ શોધવાનો અɪધકાર છે, જે એકનો ુ
આનંદ માણી શકે છે આનંદ કે નકામી પɨરણામ નથી, અથવા જે તે પીડા ટાળે છે કે તે નથી પɨરણામી
આનંદ પેદા કરે છે?
જેઓ ¢વ¢થતાǑૂવક પડો, જેથી તેઓ આનંદ મેળવવા માટે કામ કરʂ શકે અને દ: ખ, કેટલાક મહાન. ુ
કારણ કે, જેમ આપણે સૌથી નાના વ¢Ǎુઓ સાથે આવે છે, જે અમે કેટલાક લાભ મેળવવા ɫસવાય, તે
હʘમેશા દઃખદાયક શારʂɨરક ÜǘૃɫŰ લે છે આમાંથી; પરʘǍુ કોઈ Ǔૂલ શોધવાનો અɪધકાર છે, જે એકનો ુ
આનંદ માણી શકે છે આનંદ કે નકામી પɨરણામ નથી, અથવા જે તે પીડા ટાળે છે કે તે નથી પɨરણામી
આનંદ પેદા કરે છે?જેઓ ¢વ¢થતાǑૂવક પડો, જેથી તેઓ આનંદ મેળવવા માટે કામ કરʂ શકે અને દ: ખ, કેટલાક મહાન. ુ
કારણ કે, જેમ આપણે સૌથી નાના વ¢Ǎુઓ સાથે આવે છે, જે અમે કેટલાક લાભ મેળવવા ɫસવાય, તે
હʘમેશા દઃખદાયક શારʂɨરક ÜǘૃɫŰ લે છે આમાંથી; પરʘǍુ કોઈ Ǔૂલ શોધવાનો અɪધકાર છે, જે એકનો ુ
આનંદ માણી શકે છે આનંદ કે નકામી પɨરણામ નથી, અથવા જે તે પીડા ટાળે છે કે તે નથી પɨરણામી
આનંદ પેદા કરે છે?
જેઓ ¢વ¢થતાǑૂવક પડો, જેથી તેઓ આનંદ મેળવવા માટે કામ કરʂ શકે અને દ: ખ, કેટલાક મહાન. ુ
કારણ કે, જેમ આપણે સૌથી નાના વ¢Ǎુઓ સાથે આવે છે, જે અમે કેટલાક લાભ મેળવવા ɫસવાય, તે
હʘમેશા દઃખદાયક શારʂɨરક ÜǘૃɫŰ લે છે આમાંથી; પરʘǍુ કોઈ Ǔૂલ શોધવાનો અɪધકાર છે, જે એકનો ુ
આનંદ માણી શકે છે આનંદ કે નકામી પɨરણામ નથી, અથવા જે તે પીડા ટાળે છે કે તે નથી પɨરણામી
આનંદ પેદા કરે છે?"
      />
      <BuyButton history={history} />
    </View>
  );
};

const styles = StyleSheet.create({
  container: {
    flex: 1,
  },
});

export default withRouter(ProductDetailsPage);
